IDEA StatiCa Open Model
ProjectDataEc.AnnexCode Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the actual national annex
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public NationalAnnexCode AnnexCode { get; set; }
Public Property AnnexCode As NationalAnnexCode
	Get
	Set
public:
property NationalAnnexCode AnnexCode {
	NationalAnnexCode get ();
	void set (NationalAnnexCode value);
}
Property Value
Type: NationalAnnexCode
See Also
Reference
ProjectDataEc Class
IdeaRS.OpenModel Namespace